# YOLOv8n-CBAM-BiFPN Model Configuration
# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# Integrated with CBAM Attention and BiFPN for enhanced feature extraction

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # scales depth (nano version)
width_multiple: 0.25  # scales width (nano version)  
max_channels: 1024

# YOLOv8n-CBAM-BiFPN Backbone with 4-level features
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]    # 0-P1/2: 320x320
  - [-1, 1, Conv, [128, 3, 2]]   # 1-P2/4: 160x160
  - [-1, 1, C2f, [128, True]]    # 2 (repeats=1*0.33=1)
  - [-1, 1, Conv, [256, 3, 2]]   # 3-P3/8: 80x80
  - [-1, 2, C2f, [256, True]]    # 4 (repeats=6*0.33=2)
  - [-1, 1, Conv, [512, 3, 2]]   # 5-P4/16: 40x40
  - [-1, 2, C2f, [512, True]]    # 6 (repeats=6*0.33=2)
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32: 20x20
  - [-1, 1, C2f, [1024, True]]   # 8 (repeats=3*0.33=1)
  - [-1, 1, SPPF, [1024, 5]]     # 9-P6/64: 10x10

# CBAM Bottleneck for enhanced feature attention
bottleneck:
  - [[4, 6, 8, 9], 1, BottleneckCBAM, [256]]  # P2, P4, P6, P8 with CBAM attention

# BiFPN Neck for bidirectional feature fusion
head:
  # Top-down path (upsampling)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 10: P6 -> P4
  - [[-1, 6], 1, Concat, [1]]  # 11: cat with P4
  - [-1, 1, C2f, [512]]        # 12 (repeats=3*0.33=1)
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 13: P4 -> P2  
  - [[-1, 4], 1, Concat, [1]]  # 14: cat with P2
  - [-1, 1, C2f, [256]]        # 15 (P2/4-small, repeats=3*0.33=1)
  
  # Bottom-up path (downsampling)  
  - [-1, 1, Conv, [256, 3, 2]]  # 16: P2 -> P4
  - [[-1, 12], 1, Concat, [1]]  # 17: cat with P4
  - [-1, 1, C2f, [512]]         # 18 (P4/8-medium, repeats=3*0.33=1)
  
  - [-1, 1, Conv, [512, 3, 2]]  # 19: P4 -> P6
  - [[-1, 9], 1, Concat, [1]]   # 20: cat with P6
  - [-1, 1, C2f, [1024]]        # 21 (P6/16-large, repeats=3*0.33=1)
  
  - [-1, 1, Conv, [1024, 3, 2]] # 22: P6 -> P8
  - [[-1, 9], 1, Concat, [1]]   # 23: cat with P8 (SPPF)
  - [-1, 1, C2f, [1024]]        # 24 (P8/32-xlarge, repeats=3*0.33=1)
  
  # BiFPN feature fusion
  - [[15, 18, 21, 24], 1, BiFPN, [256, 4, 'fast_attn']]  # 25: BiFPN fusion
  
  # Detection heads for 4 levels
  - [[25, 0], 1, Detect, [nc]]  # 26: Detect(P2, P4, P6, P8)